{
  "projects": [
    {
      "name": "Nate Taylor's Portfolio (Version 2)",
      "description": "Nate came back to me looking to get additional work done on the site, including a change in some imagery. I rebuilt this using Svelte and Tailwind CSS. The images pop a little more thanks to Tailwind making things like box-shadow easier, the whole site is quicker to load thanks to Svelte's compile-at-build functionality, and the responsiveness is a little snappier thanks to both being lightweight yet very powerful.",
      "image": "img/projects/Nate-Site-v2.jpg",
      "liveExample": "http://www.natentaylor.com/",
      "gitHub": "https://github.com/jstrother/natentaylor-v2"
    },
    {
      "name": "Fantasy Soccer League",
      "image": "img/projects/work-in-progress.jpg",
      "description": "This is a fantasy soccer league that pulls in real-world statistics from over 40 real leagues around the world. A user is then able to create a fantasy team based upon one of those leagues, choose players, set a lineup, and compete against other users. This will be built using NuxtJS for the front, NestJS for the back, and MongoDB/Mongoose for storage. This project is going to be my most challenging project to date as I have to not only design the layout, but also determine how the various pieces need to interact with one another.",
      "liveExample": "",
      "gitHub": ""
    },
    {
      "name": "Wet Your Whistle",
      "image": "img/projects/beer-finder.JPG",
      "description": "This is an app to find breweries and brewpubs near your location. Built in SvelteJS, it is based off of the Web Geolocation API to find where you are located. Then, it uses the Google Maps API and the Open Brewer Database to find locations near you and, finally, gives you directions in an embedded Google map. Give it a try and 'Wet Your Whistle'!",
      "liveExample": "https://wet-your-whistle.herokuapp.com/",
      "gitHub": "https://github.com/jstrother/drink-local"
    },
    {
      "name": "Cryptograms",
      "image": "img/projects/cryptogram-game.JPG",
      "description": "Do you like puzzles? Then you'll enjoy this game! Movie quotes have been encrypted and it is your job to solve them. Each letter has been replaced with another one (ie- all A's have been replaced with J's). The encryption is different each time, so you'll never play the same game twice! Built with NuxtJS (and love!). Just to let you know, it is hosted on a free Heroku dyno, so give it a few extra seconds to fully spin up.",
      "liveExample": "http://cryptogram-game.herokuapp.com/",
      "gitHub": "https://github.com/jstrother/cryptogram-game"
    },
    {
      "name": "Nate Taylor's Portfolio",
      "image": "img/projects/Nate-Site.jpg",
      "description": "I built this site for an artist friend of mine as his online portfolio. I learned VueJS and Vuex for this project as Nate's single largest requirement was that the site be easy for him to maintain. There is no traditional database for this site. All of the info displayed is from a JSON file created to help his chief requirement. This has been replaced by version 2 mentioned above.",
      "liveExample": "",
      "gitHub": "https://github.com/jstrother/natentaylor"
    }
  ]
}
